#### **String İşlemleri**

# ![title](text.png)

titanic.csv dosyasındaki yolcu isimleri üzerinde;

* Büyük, küçük harf
* Noktalama işaretlerini temizleme
* Sayıları kaldırma
* Duplicate verileri kaldırma
* Replace
* Contains

işlemlerini yapıyor olacağız.

In [4]:
import pandas as pd

df = pd.read_csv(r"..\Data\titanic.csv", usecols=["Name"])

df.head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

Veri setimizde ilk olarak yolcu isimlerini büyük ve küçük şekilde listeleyelim.

In [5]:
df.Name.str.upper()

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

In [6]:
df.Name.str.lower()

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

Yolcu isimleri içerisinde geçen noktalama işaretlerini kaldıralım. Bu işlem için öncelikle **remove_punc** adında bir fonksiyon tanımlayıp ardından **apply** metodu ile isim sütununa uygulayalım. İşlenmiş datayı da **pre_name** adında yeni bir sütuna atıyoruz.

In [7]:
import string

def remove_punc(name):
    text = name.translate(name.maketrans("","", string.punctuation))

    return text

df["pre_name"] = df.Name.apply(remove_punc)

df.head()

,Name,pre_name
0,"Braund, Mr. Owen Harris",Braund Mr Owen Harris
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings Mrs John Bradley Florence Briggs Thayer
2,"Heikkinen, Miss. Laina",Heikkinen Miss Laina
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle Mrs Jacques Heath Lily May Peel
4,"Allen, Mr. William Henry",Allen Mr William Henry

Text içerisinde yer alan sayıları kaldırma işlemini yapalım.

In [8]:
df["pre_name"] = df.pre_name.str.lower().str.replace('\d', '')

df.head()

C:\Users\TCAYSAYDIN\AppData\Local\Temp\ipykernel_26872\377403931.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df["pre_name"] = df.pre_name.str.lower().str.replace('\d', '')

,Name,pre_name
0,"Braund, Mr. Owen Harris",braund mr owen harris
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",cumings mrs john bradley florence briggs thayer
2,"Heikkinen, Miss. Laina",heikkinen miss laina
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",futrelle mrs jacques heath lily may peel
4,"Allen, Mr. William Henry",allen mr william henry

**replace()** İsim bilgisi içerisinde ( ) parantezleri kaldıralım.

In [10]:
df["replace_name"] = df.Name.str.replace("(", "").str.replace(")", "")
df.head()

C:\Users\TCAYSAYDIN\AppData\Local\Temp\ipykernel_26872\4260743051.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df["replace_name"] = df.Name.str.replace("(", "").str.replace(")", "")

,Name,pre_name,replace_name
0,"Braund, Mr. Owen Harris",braund mr owen harris,"Braund, Mr. Owen Harris"
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",cumings mrs john bradley florence briggs thayer,"Cumings, Mrs. John Bradley Florence Briggs Thayer"
2,"Heikkinen, Miss. Laina",heikkinen miss laina,"Heikkinen, Miss. Laina"
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",futrelle mrs jacques heath lily may peel,"Futrelle, Mrs. Jacques Heath Lily May Peel"
4,"Allen, Mr. William Henry",allen mr william henry,"Allen, Mr. William Henry"

**contains():** İsminde William geçen yolcuları listeleyelim.

In [9]:
df[df.pre_name.str.contains('william')]

,Name,pre_name
4,"Allen, Mr. William Henry",allen mr william henry
12,"Saundercock, Mr. William Henry",saundercock mr william henry
17,"Williams, Mr. Charles Eugene",williams mr charles eugene
23,"Sloper, Mr. William Thompson",sloper mr william thompson
31,"Spencer, Mrs. William Augustus (Marie Eugenie)",spencer mrs william augustus marie eugenie
...,...,...
802,"Carter, Master. William Thornton II",carter master william thornton ii
810,"Alexander, Mr. William",alexander mr william
864,"Gill, Mr. John William",gill mr john william
880,"Shelley, Mrs. William (Imanita Parrish Hall)",shelley mrs william imanita parrish hall
885,"Rice, Mrs. William (Margaret Norton)",rice mrs william margaret norton

**duplicated()**

Veri analizinin önemli bir parçası da veri setinde yer alan tekrarlı verileri kaldırmaktır.

In [18]:
df.pre_name.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: pre_name, Length: 891, dtype: bool

In [16]:
df.pre_name.duplicated().sum()

0

**drop_duplicates()**

Yinelenen satırları drop_duplicates() metodu ile kaldırabiliriz. Name ve pre_name sütunları baz alınarak yinelenen satırları kaldıralım.

In [ ]:
df.drop_duplicates(subset=["Name", "pre_name"], keep="first", inplace=True)

df.head()

Burada **subset** metodu işlem yapacağımız sütunları belirlememizi sağlıyor.